name: "CaffeNet_Superres"
input: "data_pair"
input_dim: 1
input_dim: 5
input_dim: 436
input_dim: 256
layers {
  name: "slice_frames"
  type: SLICE
  bottom: "data_pair"
  top: "data_tm2"
  top: "data_tm1"
  top: "data_t"
  top: "data_tp1"
  top: "data_tp2"
  slice_param {
     slice_dim: 1
     slice_point: 1
     slice_point: 2
     slice_point: 3
     slice_point: 4
  }
}

# conv1_tm2
layers {
  name: "conv1_tm2"
  type: CONVOLUTION
  bottom: "data_tm2"
  top: "c1_tm2"
  convolution_param { num_output:  64    kernel_size: 3    stride: 1    pad: 1 
}
}
layers {  name: "relu1_tm2"  type: RELU  bottom: "c1_tm2"  top: "c1_tm2" }

# conv2_tm2
layers {
  name: "conv2_tm2"
  type: CONVOLUTION
  bottom: "c1_tm2"
  top: "c2_tm2"
  convolution_param { num_output:  64    kernel_size: 3    stride: 1    pad: 1 
}
}
layers {  name: "relu2_tm2"  type: RELU  bottom: "c2_tm2"  top: "c2_tm2" }

# conv3_tm2
layers {
  name: "conv3_tm2"
  type: CONVOLUTION
  bottom: "c2_tm2"
  top: "c3_tm2"
  convolution_param { num_output:  64    kernel_size: 3    stride: 1    pad: 1 
}
}
layers {  name: "relu3_tm2"  type: RELU  bottom: "c3_tm2"  top: "c3_tm2" }

# conv4_tm2
layers {
  name: "conv4_tm2"
  type: CONVOLUTION
  bottom: "c3_tm2"
  top: "c4_tm2"
  convolution_param { num_output:  64    kernel_size: 3    stride: 1    pad: 1 
}
}
layers {  name: "relu4_tm2"  type: RELU  bottom: "c4_tm2"  top: "c4_tm2" }

# conv5_tm2
layers {
  name: "conv5_tm2"
  type: CONVOLUTION
  bottom: "c4_tm2"
  top: "c5_tm2"
  convolution_param { num_output:  64    kernel_size: 3    stride: 1    pad: 1 
}
}
layers {  name: "relu5_tm2"  type: RELU  bottom: "c5_tm2"  top: "c5_tm2" }

# conv1_tm1
layers {
  name: "conv1_tm1"
  type: CONVOLUTION
  bottom: "data_tm1"
  top: "c1_tm1"
  convolution_param { num_output:  64    kernel_size: 3    stride: 1    pad: 1 
}
}
layers {  name: "relu1_tm1"  type: RELU  bottom: "c1_tm1"  top: "c1_tm1" }

# conv2_tm1
layers {
  name: "conv2_tm1"
  type: CONVOLUTION
  bottom: "c1_tm1"
  top: "c2_tm1"
  convolution_param { num_output:  64    kernel_size: 3    stride: 1    pad: 1 
}
}
layers {  name: "relu2_tm1"  type: RELU  bottom: "c2_tm1"  top: "c2_tm1" }

# conv3_tm1
layers {
  name: "conv3_tm1"
  type: CONVOLUTION
  bottom: "c2_tm1"
  top: "c3_tm1"
  convolution_param { num_output:  64    kernel_size: 3    stride: 1    pad: 1 
}
}
layers {  name: "relu3_tm1"  type: RELU  bottom: "c3_tm1"  top: "c3_tm1" }

# conv4_tm1
layers {
  name: "conv4_tm1"
  type: CONVOLUTION
  bottom: "c3_tm1"
  top: "c4_tm1"
  convolution_param { num_output:  64    kernel_size: 3    stride: 1    pad: 1 
}
}
layers {  name: "relu4_tm1"  type: RELU  bottom: "c4_tm1"  top: "c4_tm1" }

# conv5_tm1
layers {
  name: "conv5_tm1"
  type: CONVOLUTION
  bottom: "c4_tm1"
  top: "c5_tm1"
  convolution_param { num_output:  64    kernel_size: 3    stride: 1    pad: 1 
}
}
layers {  name: "relu5_tm1"  type: RELU  bottom: "c5_tm1"  top: "c5_tm1" }

# conv1_t
layers {
  name: "conv1_t"
  type: CONVOLUTION
  bottom: "data_t"
  top: "c1_t"
  convolution_param { num_output:  64    kernel_size: 3    stride: 1    pad: 1 
}
}
layers {  name: "relu1_t"  type: RELU  bottom: "c1_t"  top: "c1_t" }

# conv2_t
layers {
  name: "conv2_t"
  type: CONVOLUTION
  bottom: "c1_t"
  top: "c2_t"
  convolution_param { num_output:  64    kernel_size: 3    stride: 1    pad: 1 
}
}
layers {  name: "relu2_t"  type: RELU  bottom: "c2_t"  top: "c2_t" }

# conv3_t
layers {
  name: "conv3_t"
  type: CONVOLUTION
  bottom: "c2_t"
  top: "c3_t"
  convolution_param { num_output:  64    kernel_size: 3    stride: 1    pad: 1 
}
}
layers {  name: "relu3_t"  type: RELU  bottom: "c3_t"  top: "c3_t" }

# conv4_t
layers {
  name: "conv4_t"
  type: CONVOLUTION
  bottom: "c3_t"
  top: "c4_t"
  convolution_param { num_output:  64    kernel_size: 3    stride: 1    pad: 1 
}
}
layers {  name: "relu4_t"  type: RELU  bottom: "c4_t"  top: "c4_t" }

# conv5_t
layers {
  name: "conv5_t"
  type: CONVOLUTION
  bottom: "c4_t"
  top: "c5_t"
  convolution_param { num_output:  64    kernel_size: 3    stride: 1    pad: 1 
}
}
layers {  name: "relu5_t"  type: RELU  bottom: "c5_t"  top: "c5_t" }

# conv1_tp1
layers {
  name: "conv1_tp1"
  type: CONVOLUTION
  bottom: "data_tp1"
  top: "c1_tp1"
  convolution_param { num_output:  64    kernel_size: 3    stride: 1    pad: 1 
}
}
layers {  name: "relu1_tp1"  type: RELU  bottom: "c1_tp1"  top: "c1_tp1" }

# conv2_tp1
layers {
  name: "conv2_tp1"
  type: CONVOLUTION
  bottom: "c1_tp1"
  top: "c2_tp1"
  convolution_param { num_output:  64    kernel_size: 3    stride: 1    pad: 1 
}
}
layers {  name: "relu2_tp1"  type: RELU  bottom: "c2_tp1"  top: "c2_tp1" }

# conv3_tp1
layers {
  name: "conv3_tp1"
  type: CONVOLUTION
  bottom: "c2_tp1"
  top: "c3_tp1"
  convolution_param { num_output:  64    kernel_size: 3    stride: 1    pad: 1 
}
}
layers {  name: "relu3_tp1"  type: RELU  bottom: "c3_tp1"  top: "c3_tp1" }

# conv4_tp1
layers {
  name: "conv4_tp1"
  type: CONVOLUTION
  bottom: "c3_tp1"
  top: "c4_tp1"
  convolution_param { num_output:  64    kernel_size: 3    stride: 1    pad: 1 
}
}
layers {  name: "relu4_tp1"  type: RELU  bottom: "c4_tp1"  top: "c4_tp1" }

# conv5_tp1
layers {
  name: "conv5_tp1"
  type: CONVOLUTION
  bottom: "c4_tp1"
  top: "c5_tp1"
  convolution_param { num_output:  64    kernel_size: 3    stride: 1    pad: 1 
}
}
layers {  name: "relu5_tp1"  type: RELU  bottom: "c5_tp1"  top: "c5_tp1" }

# conv1_tp2
layers {
  name: "conv1_tp2"
  type: CONVOLUTION
  bottom: "data_tp2"
  top: "c1_tp2"
  convolution_param { num_output:  64    kernel_size: 3    stride: 1    pad: 1 
}
}
layers {  name: "relu1_tp2"  type: RELU  bottom: "c1_tp2"  top: "c1_tp2" }

# conv2_tp2
layers {
  name: "conv2_tp2"
  type: CONVOLUTION
  bottom: "c1_tp2"
  top: "c2_tp2"
  convolution_param { num_output:  64    kernel_size: 3    stride: 1    pad: 1 
}
}
layers {  name: "relu2_tp2"  type: RELU  bottom: "c2_tp2"  top: "c2_tp2" }

# conv3_tp2
layers {
  name: "conv3_tp2"
  type: CONVOLUTION
  bottom: "c2_tp2"
  top: "c3_tp2"
  convolution_param { num_output:  64    kernel_size: 3    stride: 1    pad: 1 
}
}
layers {  name: "relu3_tp2"  type: RELU  bottom: "c3_tp2"  top: "c3_tp2" }

# conv4_tp2
layers {
  name: "conv4_tp2"
  type: CONVOLUTION
  bottom: "c3_tp2"
  top: "c4_tp2"
  convolution_param { num_output:  64    kernel_size: 3    stride: 1    pad: 1 
}
}
layers {  name: "relu4_tp2"  type: RELU  bottom: "c4_tp2"  top: "c4_tp2" }

# conv5_tp2
layers {
  name: "conv5_tp2"
  type: CONVOLUTION
  bottom: "c4_tp2"
  top: "c5_tp2"
  convolution_param { num_output:  64    kernel_size: 3    stride: 1    pad: 1 
}
}
layers {  name: "relu5_tp2"  type: RELU  bottom: "c5_tp2"  top: "c5_tp2" }

layers {
  name: "concat1"
  bottom: "c5_tm2"
  bottom: "c5_tm1"
  bottom: "c5_t"
  bottom: "c5_tp1"
  bottom: "c5_tp2"
  top: "conv5"
  type: CONCAT
  concat_param {
    concat_dim: 1
  }
}

# deconv1
layers {
  name: "deconv1"
  type: DECONVOLUTION
  bottom: "conv5"
  top: "d1"
  convolution_param { num_output:  64    kernel_size: 3    stride: 1    pad: 1 
}
}

# residual1
layers {
  name: "residual1"
  type: ELTWISE
  bottom: "c4_tm2"
  bottom: "c4_tm1"
  bottom: "c4_t"
  bottom: "c4_tp1"
  bottom: "c4_tp2"
  bottom: "d1"
  top: "d1a"
}
layers {  name: "relu6"  type: RELU  bottom: "d1a"  top: "d1a" }

# deconv2
layers {
  name: "deconv2"
  type: DECONVOLUTION
  bottom: "d1a"
  top: "d2"
  convolution_param { num_output:  64    kernel_size: 3    stride: 1    pad: 1 
}
}
layers {  name: "relu7"  type: RELU  bottom: "d2"  top: "d2" }

# deconv3
layers {
  name: "deconv3"
  type: DECONVOLUTION
  bottom: "d2"
  top: "d3"
  convolution_param { num_output:  64    kernel_size: 3    stride: 1    pad: 1 
}
}

# residual2
layers {
  name: "residual2"
  type: ELTWISE
  bottom: "c2_tm2"
  bottom: "c2_tm1"
  bottom: "c2_t"
  bottom: "c2_tp1"
  bottom: "c2_tp2"
  bottom: "d3"
  top: "d3a"
}
layers {  name: "relu8"  type: RELU  bottom: "d3a"  top: "d3a" }

# deconv4
layers {
  name: "deconv4"
  type: DECONVOLUTION
  bottom: "d3a"
  top: "d4"
  convolution_param { num_output:   64   kernel_size: 3    stride: 1    pad: 1 
}
}
layers {  name: "relu9"  type: RELU bottom: "d4"  top: "d4" }

# deconv5
layers {
  name: "deconv5"
  type: DECONVOLUTION
  bottom: "d4"
  top: "d5"
  convolution_param { num_output:   1    kernel_size: 3    stride: 1    pad: 1 

}
}

# residual3
layers {
  name: "residual3"
  type: ELTWISE
  bottom: "data_t"
  bottom: "d5"
  top: "d5a"
}
layers {  name: "relu10"  type: RELU  bottom: "d5a"  top: "d5a" }
